app/controllers/authors_controller.rb

  def posts_index
    @authors = Author.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]